Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: foreach my $key (keys %hash) {
es_es: foreach my $clave (keys %hash) {

source: perlretut Perl regular expressions tutorial
es_es: perlretut Tutorial de expresiones regulares

source: =head2 Logical Not X<operator, logical, not> X<not>
es_es: =head2 Not lógico X<operator, logical, not> X<not> X<operador, lógico, not> X<not> X<no>

source: (Note that this utility requires the C<Text::Diff> module to function properly; this module isn't distributed with perl, but is available from the CPAN.)
es_es: (Tenga en cuenta que esta utilidad requiere el módulo C<Text::Diff> para funcionar correctamente; este módulo no se distribuye con perl, pero está disponible en CPAN.)

source: That is, if the left operand is false, the right operand is not even evaluated.
es_es: Es decir, si el operando izquierdo es falso, el operando de la derecha no es ni siquiera evaluado.

source: select(REPORT2);
es_es: select(INFORME2);

source: The rest need it.
es_es: El resto lo necesita.

source: my $sentence_rx = qr{
es_es: my $sentencia_rx = qr{

source: One simple way to check that things are in the right place is to print out the hard-coded C<@INC> that perl looks through for libraries:
es_es: Una manera sencilla de comprobar que todo está en su sitio es imprimir en pantalla la variable C<@INC> incrustada en el programa, en la que perl busca las bibliotecas:

source: If you are using named captures in a branch reset pattern, it's best to use the same names, in the same order, in each of the alternations:
es_es: Si está utilizando capturas nominadas en un patrón de reinicio de rama, lo mejor es utilizar los mismos nombres, en el mismo orden, en cada una de las alternativas:

source: OO Perl is relatively simple and is implemented using references which know what sort of object they are based on Perl's concept of packages.
es_es: La programación orientada a objetos en Perl es relativamente sencilla y se implementa con referencias que "conocen" qué tipo de objeto son, basándose en el concepto de paquetes de Perl.

source: To learn how to install modules you download from CPAN, read L<perlmodinstall>.
es_es: Para aprender a instalar los módulos que descargue de CPAN, lea L<perlmodinstall>.

source: By default, when a quantified subpattern does not allow the rest of the overall pattern to match, Perl will backtrack.
es_es: De forma predeterminada, cuando un sub-patrón cuantificado no permite que el resto del patrón coincida, Perl dará marcha atrás.

source: warn "That doesn't look like a number";
es_es: warn "Esto no parece un número";

source: # Both of these count from 0 to 10.
es_es: # Estas dos líneas cuentan de 0 a 10.

source: Input from <> comes either from standard input, or from each file listed on the command line.
es_es: La entrada desde <> puede venir, ya sea desde la entrada estándar, o de cada archivo listado en la línea de comandos.

source: There is a special form of this construct, called C<\K>, which causes the regex engine to "keep" everything it had matched prior to the C<\K> and not include it in C<$&>.
es_es: Hay una forma especial de esta construcción, llamada C<\K>, que hace que el motor regex "salte" todo lo que haya coincidido anteriormente a la C<\K> y no lo incluya en C<$&>.

source: Beware that using C<eval> neither silences Perl from printing warnings to STDERR, nor does it stuff the text of warning messages into C<$@>.
es_es: Tenga cuidado porque usar C<eval> ni silencia a Perl a la hora de imprimir avisos al STDERR, ni rellena el texto de los mensajes de aviso dentro de C<$@>.

source: if (exists $INC{$filename}) { return 1 if $INC{$filename}; die "Compilation failed in require";
es_es: if (exists $INC{$archivo}) { return 1 if $INC{$archivo}; die "Falló la compilación en require";

source: Frequently called programs (like CGI scripts) that simply use
es_es: Programas ejecutados frecuentemente (como los scripts CGI) usan, simplemente,

source: The scripts and library files supplied as input to or produced as output from the programs of this Package do not automatically fall under the copyright of this Package, but belong to whoever generated them, and may be sold commercially, and may be aggregated with this Package.
es_es: Las secuencias de comandos y archivos de biblioteca suministrados como entrada o producidos como salida de los programas de este Paquete no quedan automáticamente bajo el copyright de este Paquete, sino que pertenecen a quien los ha generado, y puede ser vendidos comercialmente, y se podrán sumar a este paquete.

source: Just because you can subscript a list value like a normal array does not mean that you can subscript a list value as a hash.
es_es: Sólo porque usted puede indexar una lista de valores como un array normal no significa que puede indexar una lista de valores como un hash.

source: =item flock FILEHANDLE,OPERATION X<flock> X<lock> X<locking>
es_es: =item flock IDENTIFICADOR_ARCHIVO,OPERACIÓN X<flock> X<lock> X<locking>

source: The following problems are encountered with Haiku revision 28311:
es_es: Los siguientes problemas se encuentran en la versión Haiku 28311:

source: say "I like apples." when /apples?/;
es_es: say "Me gustan las manzanas." when /manzanas?/;

source: if (exists $hash{A}{B}{$key}) { }
es_es: if (exists $hash{A}{B}{$clave}) { }

source: Thus, writers of overloading routines for smart match mostly need to worry only with comparing against a scalar, and possibly with stringification overloading; the other common cases will be automatically handled consistently.
es_es: Por lo tanto, los programadores de rutinas de sobrecarga de coincidencia inteligente solo tienen que preocuparse de la comparación contra un escalar, y posiblemente, con una sobrecarga de la operación de convertir en cadena de caracteres; los otros casos comunes serán automáticamente gestionados de forma coherente.

source: =head2 Updated Modules
es_es: =head2 Módulos actualizados

source: exec $shell '-sh'; # pretend it's a login shell
es_es: exec $shell '-sh'; # finge que es un shell de login

source: Some of these pseudo-modules import semantics into the current block scope (like C<strict> or C<integer>, unlike ordinary modules, which import symbols into the current package (which are effective through the end of the file).
es_es: Algunos de estos pseudo-módulos importa semántica en el ámbito del bloque actual (como C<strict> o C<integer>, a diferencia de los módulos comunes, que importan los símbolos en el paquete actual (que son efectivos hasta el final del archivo).

source: Case I<is> significant--"FOO", "Foo", and "foo" are all different names.
es_es: El tamaño de caja I<es> significativo: "FOO", "Foo" y "foo" son todos ellos nombres diferentes.

source: This is I<not> what you want to use to capture the output from a command; for that you should use merely backticks or C<qx//>, as described in L<perlop/"`STRING`">.
es_es: Esto I<no> es lo que desea utilizar para capturar la salida de un comando; para eso debería utilizar solamente las comillas invertidas o C<qx//>, como se describe en L<perlop/"`CADENA`">.

source: X<variable, built-in>
es_es: X<variable, built-in> X<variable, primitiva>

source: Whereas here's how a Perl programmer more comfortable with the idiom might do it:
es_es: Y aquí está cómo un programador de Perl, más cómodo con el lenguaje, puede hacer:

source: line-noise lowercase line-noise UPPERCASE line-noise UPPERCASE
es_es: línea-ruido minúsculas línea-ruido MAYÚSCULAS línea-ruido MAYÚSCULAS

source: In general, you want to use either the current stable release, or the stable release immediately prior to that one.
es_es: En general, conviene usar la versión estable actual o la versión estable inmediatamente anterior.

source: Shrink-wrapped CDs with perl on them are available from several sources if that will help.
es_es: Si sirve de ayuda, varias fuentes ofrecen CDs empaquetados.

source: It binds even more tightly than unary minus, so -2**4 is -(2**4), not (-2)**4.
es_es: Se une aún más estrechamente que la resta unaria, por lo que -2**4 es -(2**4), no (-2)**4.

source: Who develops it?
es_es: ¿Quién lo desarrolla?

source: To mark FILEHANDLE as UTF-8, use C<:utf8> or C<:encoding(UTF-8)>.
es_es: Para indicar IDENTIFICADOR_ARCHIVO como UTF-8, use C<:utf8> o C<:encoding(UTF-8)>.

source: perlfork Perl fork() information
es_es: perlfork Información sobre fork()

source: =item waitpid PID,FLAGS
es_es: =item waitpid PID,BANDERAS

source: $ref_to_AoA = [
es_es: $ref_a_AoA = [

source: print ($foo), exit; # Or even this.
es_es: print ($foo), exit; # O incluso esto.

source: The keywords C<given> and C<when> are analogous to C<switch> and C<case> in other languages, so the code above could be written as
es_es: Las palabras clave C<given> y C<when> son análogos a C<switch> y C<case> en otros lenguajes, por lo que el código anterior podrá ser escrito como

source: Google "larry wall quotes"!
es_es: ¡Busque "larry wall quotes" en Google!

source: Then
es_es: Entonces

source: For that, try something more like:
es_es: Para esto, intente algo como esto:

source: perlcompile Perl compiler suite intro
es_es: perlcompile Herramientas de compilación de Perl

source: Used together, as C</ms>, they let the "." match any character whatsoever, while still allowing "^" and "$" to match, respectively, just after and just before newlines within the string.
es_es: Usados juntos, como C</ms>, permiten que "." coincida con cualquier carácter, mientras que siguen permitiendo que "^" y "$" coincidan, respectivamente, con el después y el antes de los caracteres nueva línea dentro de la cadena.

source: =item Arithmetic operators during C<use integer>
es_es: =item Operadores aritméticos con C<use integer> activo

source: A null pointer is created if the corresponding value for C<p> or C<P> is C<undef>; similarly with unpack(), where a null pointer unpacks into C<undef>.
es_es: Un puntero nulo es creado si el valor correspondiente para C<p> o C<P> es C<undef>; de forma similar con unpack(), donde un puntero nulo se descomprime en C<undef>.

source: Real numbers (floats and doubles) are in native machine format only.
es_es: Los números reales (float y double) solo están en formato nativo de la máquina.

source: Unlike C<dbmopen>, the C<tie> function will not C<use> or C<require> a module for you; you need to do that explicitly yourself.
es_es: A diferencia de C<dbmopen>, la función C<tie> no usará C<use> o C<require> de un módulo por usted; necesitará hacerlo de forma explícita.

source: =head2 Has it been done before?
es_es: =head2 ¿Se ha hecho antes?

source: force the argument into the string format.
es_es: Fuerzan la conversión del argumento al formato de cadena.

source: If you get to choose, it's a good idea to standardize on UTF-8.
es_es: Si puede elegir, es recomendable utilizar UTF-8 de manera estándar.

source: S_IMODE($mode) the part of $mode containing the permission bits and the setuid/setgid/sticky bits
es_es: S_IMODE($modo) la parte de $modo conteniendo los bit de permiso y los bit setuid/setgid/sticky

source: Several modules let you calculate with (bound only by memory and CPU time) unlimited or fixed precision.
es_es: Hay varios módulos que permiten calcular con precisión fija o ilimitada (limitada únicamente por la memoria y el tiempo de CPU).

source: The match operator.
es_es: El operador de emparejamiento.

source: This function works like the system call by the same name: it makes the named directory the new root directory for all further pathnames that begin with a C</> by your process and all its children.
es_es: Esta funcion trabaja como la llamada del sistema del mismo nombre: hace que el directorio indicado sea el directorio raíz de los siguientes caminos que comiencen por un C</> en su proceso y todos sus hijos.

source: Binary "<=>" returns -1, 0, or 1 depending on whether the left argument is numerically less than, equal to, or greater than the right argument.
es_es: Binario "<=>" devuelve -1, 0, o 1 dependiendo de si el argumento de la izquierda es numéricamente menor, igual o mayor que el argumento de la derecha.

source: A program is what you give the audience."
es_es: y que un programa es lo que se ofrece al público."

source: perlmroapi Perl method resolution plugin interface
es_es: perlmroapi Interfaz de complementos: resolución de métodos

source: TYPE is currently bound to the use of C<fields> pragma, and attributes are handled using the C<attributes> pragma, or starting from Perl 5.8.0 also via the C<Attribute::Handlers> module.
es_es: TIPO está vinculado al uso del pragma C<fields>, y los atributos se manejan con el pragma C<attributes>, o a partir de Perl 5.8.0 también a través del módulo C<Attribute::Handlers>.

source: gcc versions 3.x introduced a new warning that caused a lot of noise during Perl compilation: C<gcc -Ialreadyknowndirectory (warning: changing search order)>.
es_es: versiones 3.x de gcc introdujeron una nueva advertencia que causaba mucho ruido en la compilación Perl: C<gcc -Ialreadyknowndirectory (advertencia: cambiando el órden de búsqueda)>.

source: Anything matching PATTERN is taken to be a delimiter separating the fields.
es_es: Cualquier cosa concordante con el PATRÓN se toma como un delimitador que separa los campos.

source: An "independent" subexpression, one which matches the substring that a I<standalone> C<pattern> would match if anchored at the given position, and it matches I<nothing other than this substring>.
es_es: Un subexpresión "independiente", aquella que coincide la subcadena con un I<único> C<patrón> que coincidiría si estuviera anclada en la posición indicada, y no coincide con I<ninguna otra más que esta subcadena>.

source: You may explicitly show which type of operation you intend by using C<""> or C<0+>, as in the examples below.
es_es: Puede indicar, explícitamente, el tipo de operación que desea realizar utilizando C<""> o C<0+>, como en los ejemplos siguientes.

source: Many modules updated from CPAN incorporate new tests.
es_es: Muchos módulos actualizados desde CPAN incorporan nuevas pruebas.

source: To delete a filter pass C<undef> to it.
es_es: Para eliminar un filtro debe pasarle C<undef>.

source: =head2 Additive Operators X<operator, additive>
es_es: =head2 Operadores aditivos X<operator, additive> X<operador, aditivo>

source: Since you can assign to a list of variables, you can also assign to an array or hash slice.
es_es: Ya que se puede asignar a una lista de variables, también se puede asignar a un array o una porción de hash.

source: =head2 New "To%s: illegal mapping '%s'"
es_es: =head2 Nuevo "I<To%s: illegal mapping '%s'>" (A %s: mapeo ilegal '%s')

source: This function is now largely obsolete, mostly because it's very hard to convert a core file into an executable.
es_es: Esta función es obsoleta desde hace mucho tiempo, en parte porque es muy difícil convertir un volcado del núcleo en un ejecutable.

source: For portability, when using features that may not be implemented on every machine, test the construct in an eval to see if it fails.
es_es: Para la portabilidad, cuando utilice características que pueden no estar implementadas en todas las máquinas, compruebe el código en un eval para ver si falla.

source: The following pattern matches a parenthesized group:
es_es: El siguiente patrón coincide con un grupo de paréntesis:

source: F<perldoc> will extract and format the documentation from any file in the current directory, any Perl module installed on the system, or any of the standard documentation pages, such as this one.
es_es: F<perldoc> extrae y aplica formato a la documentación de cualquier archivo del directorio actual, cualquier módulo Perl instalado en el sistema o cualquiera de las páginas de documentación estándar, como ésta.

source: It can be helpful to check C<$!> when you are reading from filehandles you don't trust, such as a tty or a socket.
es_es: Puede ser útil comprobar C<$!> cuando está leyendo de identificadores de archivo en los que no confía, como tty o un socket.

source: Use a PID of C<0> to get the current process group for the current process.
es_es: Use un PID de C<0> para obtener el grupo del proceso actual.

source: Entire arrays (and slices of arrays and hashes) are denoted by '@', which works much as the word "these" or "those" does in English, in that it indicates multiple values are expected.
es_es: Los arrays enteros (y las porciones de arrays o hashes) son designados por '@', que funciona como los determinantes "estos" o "esos" del Español, indicando que se esperan múltiples valores.

source: To simplify multi-line substitutions, the "." character never matches a newline unless you use the C</s> modifier, which in effect tells Perl to pretend the string is a single line--even if it isn't.
es_es: Para simplificar la sustitución de varias líneas, el carácter "." no coincide con una nueva línea a menos que utilice el modificador C</s>, que en efecto dice a Perl que asuma que la cadena es una sola línea -incluso si no lo es-.

source: Hash Regex hash key grep grep /$b/, keys %$a
es_es: Hash Regex grep clave hash grep /$b/, keys %$a

source: Make sure you choose an appropriate name for your module early on.
es_es: Asegúrese de elegir un nombre apropiado para el módulo desde el principio.

source: $a = $ok ? @b : @c; # oops, that's just a count!
es_es: $a = $ok ? @b : @c; # oops, ¡esto solo cuenta elementos!

source: F<termcap.pl>, F<tainted.pl>, F<stat.pl>, F<shellwords.pl>, F<pwd.pl>, F<open3.pl>, F<open2.pl>, F<newgetopt.pl>, F<look.pl>, F<find.pl>, F<finddepth.pl>, F<importenv.pl>, F<hostname.pl>, F<getopts.pl>, F<getopt.pl>, F<getcwd.pl>, F<flush.pl>, F<fastcwd.pl>, F<exceptions.pl>, F<ctime.pl>, F<complete.pl>, F<cacheout.pl>, F<bigrat.pl>, F<bigint.pl>, F<bigfloat.pl>, F<assert.pl>, F<abbrev.pl>, F<dotsh.pl>, and F<timelocal.pl> are all now deprecated.
es_es: F<termcap.pl>, F<tainted.pl>, F<stat.pl>, F<shellwords.pl>, F<pwd.pl>, F<open3.pl>, F<open2.pl>, F<newgetopt.pl>, F<look.pl>, F<find.pl>, F<finddepth.pl>, F<importenv.pl>, F<hostname.pl>, F<getopts.pl>, F<getopt.pl>, F<getcwd.pl>, F<flush.pl>, F<fastcwd.pl>, F<exceptions.pl>, F<ctime.pl>, F<complete.pl>, F<cacheout.pl>, F<bigrat.pl>, F<bigint.pl>, F<bigfloat.pl>, F<assert.pl>, F<abbrev.pl>, F<dotsh.pl>, y F<timelocal.pl> son ahora obsoletas.

source: (Make . match a newline)
es_es: (Hace que . coincida con un car. de nueva línea)

source: If you've used -OPT:fast_io=ON and this happens, try removing it.
es_es: Si ha utilizado -OPT:fast_io=ON y sucede esto, pruebelo de nuevo quitándolo antes.

source: In older versions of Perl, if your system had neither DBM nor ndbm, calling C<dbmopen> produced a fatal error; it now falls back to sdbm(3).
es_es: En las viejas versiones de Perl, si el sistema no tenía ni DBM ni ndbm, llamando a C<dbmopen> producía un error fatal; ahora lo intentaría con sdbm(3).

source: For further details see L<perltie>, L<"tied VARIABLE">.
es_es: Para más detalles, vea L<perltie>, L<"tied VARIABLE">.

source: Multiple C<our> declarations with the same name in the same lexical scope are allowed if they are in different packages.
es_es: Múltiples declaraciones C<our> con el mismo nombre en el mismo ámbito léxico son permitidas si están en diferentes paquetes.

source: This:
es_es: Este:

source: return unless defined wantarray; # don't bother doing more
es_es: return unless defined wantarray; # no nos molestamos más

source: See L<overload> for details about that.
es_es: Ver L<overload> para los detalles sobre esto.

source: \p{Lu} # capital letter
es_es: \p{Lu} # letra mayúscula

source: When a space and a plus sign are given as the flags at once, a plus sign is used to prefix a positive number.
es_es: Cuando un espacio y un signo más se dan como banderas de forma simultánea, un signo más es usado para prefijar un número positivo.

source: It is not illegal to clear a restricted hash, so the warning was removed.
es_es: No es ilegal borrar un hash restringido, por lo que el aviso fue retirado.

source: =head2 Comments X<comment> X<#>
es_es: =head2 Comentarios X<comment> X<#> X<comentario>

source: The operator may be any of:
es_es: El operador puede ser cualquiera de:

source: In particular the following metacharacters have their standard I<egrep>-ish meanings: X<metacharacter> X<\> X<^> X<.> X<$> X<|> X<(> X<()> X<[> X<[]>
es_es: En particular, los siguientes metacaracteres mantienen su significados estándar heredados del C<egrep>: X<metacarácter> X<\> X<^> X<.> X<$> X<|> X<(> X<()> X<[> X<[]>

source: add the sort pragma
es_es: añadido el pragma sort

source: A memory leak in the fork() emulation has been fixed.
es_es: Una pérdida de memoria en la emulación de fork() se ha arreglado.

source: Due to its precedence, you must be careful to avoid using it as replacement for the C<||> operator.
es_es: Debido a su precedencia, debería evitar el uso de este operador como un reemplazo del operador C<||>.

source: The C<next> command starts the next iteration of the loop:
es_es: El comando C<next> inicia la siguiente iteración del bucle:

source: Returns C<1> for success; on error, returns C<undef> if the first argument is not a valid filehandle, or returns C<0> and sets C<$!> for any other failure.
es_es: Devuelve C<1> para el éxito; en caso de error, devuelve C<undef> si el primer argumento no es un identificador de archivo válido, o devuelve C<0> y actualiza C<$!> por cualquier otro error.

source: (*) Not all fields are supported on all filesystem types.
es_es: (*) No todos los campos están soportados por todos los sistemas de archivos.

source: The default argument to the C<shift> function just happens to be C<@_>.
es_es: El argumento predeterminado de la función C<shift> es C<@_>.

source: A comprehensive list of Perl-related mailing lists can be found at:
es_es: Encontrará una lista completa de listas de correo relacionadas con Perl en:

# print "ok ";
source: print "ok\n";
es_es: print "correcto\n";

source: F<cpan> is a command-line interface to CPAN.pm.
es_es: F<cpan> es una interfaz de línea de comandos de CPAN.pm.

source: $now_string = strftime "%a %b %e %H:%M:%S %Y", localtime;
es_es: $ahora = strftime "%a %b %e %H:%M:%S %Y", localtime;

source: with any non-default flags appearing between the caret and the colon.
es_es: con cualquier bandera que no esté puesta por defecto apareciendo entre el circunflejo y el carácter de dos puntos.

source: The F<Configure> script is ultimately responsible for generating a F<Makefile>.
es_es: El script F<Configure> se encarga de generar un archivo F<Makefile>.

source: l interpret integer as C type "long" or "unsigned long"
es_es: l interpreta un entero como un "long" o "unsigned long" del C

source: =item getservbyname NAME,PROTO
es_es: =item getservbyname NOMBRE,PROTO

source: use warnings; "$foo" LINKS
es_es: use warnings; "$foo" VÍNCULOS

source: =head2 Conditional Operator X<operator, conditional> X<operator, ternary> X<ternary> X<?:>
es_es: =head2 Operadores condicionales X<operator, conditional> X<operator, ternary> X<ternary> X<?:> X<operador, condicional> X<operador, ternario> X<ternario>

source: If VARIABLE is a hash, it chomps the hash's values, but not its keys.
es_es: Si VARIABLE es un hash, recorta los valores del hash, pero no sus claves.

source: Attempting to do so raises an exception.
es_es: Intentarlo, lanza una excepción.

source: 0x12 0x34 0x56 0x78 # big-endian
es_es: 0x12 0x34 0x56 0x78 # big-endian (byte superior antes)

source: However, the new safer model has its problems too.
es_es: Sin embargo, el nuevo modelo de seguridad también tiene sus problemas.

source: In particular, this means that you shouldn't use this for selecting between two aggregates for assignment:
es_es: En particular, esto significa que usted no debería usar esto para seleccionar entre dos agregados para hacer una asignación:
